avr-rust/avrd/packs/atmega/ATmega2564RFR2.atdf
        <register caption="Battery Monitor Control and Status Register" name="BATMON" offset="0x151" size="1">
          <bitfield caption="Battery Monitor Interrupt Status" mask="0x80" name="BAT_LOW"/>
          <bitfield caption="Battery Monitor Interrupt Enable" mask="0x40" name="BAT_LOW_EN"/>
          <bitfield caption="Battery Monitor Status" mask="0x20" name="BATMON_OK" values="BATMON_OK_bitf"/>
          <bitfield caption="Battery Monitor Voltage Range" mask="0x10" name="BATMON_HR" values="BATMON_HR_bitf"/>
          <bitfield caption="Battery Monitor Threshold Voltage" mask="0x0F" name="BATMON_VTH" values="BATMON_VTH_bitf"/>
        </register>
        <register caption="Crystal Oscillator Control Register" name="XOSC_CTRL" offset="0x152" size="1">
          <bitfield caption="Crystal Oscillator Operating Mode" mask="0xF0" name="XTAL_MODE" values="XTAL_MODE_BITF"/>
          <bitfield caption="Crystal Oscillator Load Capacitance Trimming" mask="0x0F" name="XTAL_TRIM" values="XTAL_TRIM_bitf"/>
        </register>
        <register caption="Channel Control Register 0" name="CC_CTRL_0" offset="0x153" size="1">
          <bitfield caption="Channel Number" mask="0xFF" name="CC_NUMBER"/>
        </register>
        <register caption="Channel Control Register 1" name="CC_CTRL_1" offset="0x154" size="1">
          <bitfield caption="Channel Band" mask="0x0F" name="CC_BAND"/>
        </register>
        <register caption="Transceiver Receiver Sensitivity Control Register" name="RX_SYN" offset="0x155" size="1">
          <bitfield caption="Prevent Frame Reception" mask="0x80" name="RX_PDT_DIS"/>
          <bitfield caption="Receiver Override Function" mask="0x40" name="RX_OVERRIDE"/>
          <bitfield caption="Reduce Receiver Sensitivity" mask="0x0F" name="RX_PDT_LEVEL" values="RX_PDT_LEVEL_BITF"/>
        </register>
        <register caption="Transceiver Reduced Power Consumption Control" name="TRX_RPC" offset="0x156" size="1">
          <bitfield caption="Smart Receiving Mode Timing" mask="0xC0" name="RX_RPC_CTRL" values="RX_RPC_CTRL_BITF"/>
          <bitfield caption="Reciver Smart Receiving Mode Enable" mask="0x20" name="RX_RPC_EN"/>
          <bitfield caption="Smart Receiving Mode Reduced Sensitivity Enable" mask="0x10" name="PDT_RPC_EN"/>
          <bitfield caption="PLL Smart Receiving Mode Enable" mask="0x08" name="PLL_RPC_EN"/>
          <bitfield caption="Reserved" mask="0x04" name="Res0"/>
          <bitfield caption="Smart Receiving Mode IPAN Handling Enable" mask="0x02" name="IPAN_RPC_EN"/>
          <bitfield caption="Smart Receiving in Extended Operating Modes Enable" mask="0x01" name="XAH_RPC_EN"/>
        </register>
        <register caption="Transceiver Acknowledgment Frame Control Register 1" name="XAH_CTRL_1" offset="0x157" size="1">
          <bitfield caption="Filter Reserved Frames" mask="0x20" name="AACK_FLTR_RES_FT"/>
          <bitfield caption="Process Reserved Frames" mask="0x10" name="AACK_UPLD_RES_FT"/>
          <bitfield caption="Reduce Acknowledgment Time" mask="0x04" name="AACK_ACK_TIME" values="AACK_ACK_TIME_bitf"/>
          <bitfield caption="Enable Promiscuous Mode" mask="0x02" name="AACK_PROM_MODE"/>
        </register>
        <register caption="Transceiver Filter Tuning Control Register" name="FTN_CTRL" offset="0x158" size="1">
          <bitfield caption="Start Calibration Loop of Filter Tuning Network" mask="0x80" name="FTN_START"/>
        </register>
        <register caption="Transceiver Center Frequency Calibration Control Register" name="PLL_CF" offset="0x15A" size="1">
          <bitfield caption="Start Center Frequency Calibration" mask="0x80" name="PLL_CF_START"/>
        </register>
        <register caption="Transceiver Delay Cell Calibration Control Register" name="PLL_DCU" offset="0x15B" size="1">
          <bitfield caption="Start Delay Cell Calibration" mask="0x80" name="PLL_DCU_START"/>
        </register>
        <register caption="Device Identification Register (Part Number)" name="PART_NUM" offset="0x15C" size="1" ocd-rw="R">
          <bitfield caption="Part Number" mask="0xFF" name="PART_NUM" values="PART_NUM_bitf"/>
        </register>
        <register caption="Device Identification Register (Version Number)" name="VERSION_NUM" offset="0x15D" size="1" ocd-rw="R">
          <bitfield caption="Version Number" mask="0xFF" name="VERSION_NUM" values="VERSION_NUM_2_BITF"/>
        </register>
        <register caption="Device Identification Register (Manufacture ID Low Byte)" name="MAN_ID_0" offset="0x15E" size="1" ocd-rw="R">
          <bitfield caption="Manufacturer ID (Low Byte)" mask="0x80" name="MAN_ID_07"/>
          <bitfield caption="Manufacturer ID (Low Byte)" mask="0x40" name="MAN_ID_06"/>
          <bitfield caption="Manufacturer ID (Low Byte)" mask="0x20" name="MAN_ID_05"/>
          <bitfield caption="Manufacturer ID (Low Byte)" mask="0x10" name="MAN_ID_04"/>
          <bitfield caption="Manufacturer ID (Low Byte)" mask="0x08" name="MAN_ID_03"/>
          <bitfield caption="Manufacturer ID (Low Byte)" mask="0x04" name="MAN_ID_02"/>
          <bitfield caption="Manufacturer ID (Low Byte)" mask="0x02" name="MAN_ID_01"/>
          <bitfield caption="Manufacturer ID (Low Byte)" mask="0x01" name="MAN_ID_00" values="MAN_ID_0_BITF"/>
        </register>
        <register caption="Device Identification Register (Manufacture ID High Byte)" name="MAN_ID_1" offset="0x15F" size="1" ocd-rw="R">
          <bitfield caption="Manufacturer ID (High Byte)" mask="0xFF" name="MAN_ID_" values="MAN_ID_1_BITF" lsb="10"/>
        </register>
        <register caption="Transceiver MAC Short Address Register (Low Byte)" name="SHORT_ADDR_0" offset="0x160" size="1">
          <bitfield caption="MAC Short Address" mask="0x80" name="SHORT_ADDR_07"/>
          <bitfield caption="MAC Short Address" mask="0x40" name="SHORT_ADDR_06"/>
          <bitfield caption="MAC Short Address" mask="0x20" name="SHORT_ADDR_05"/>
          <bitfield caption="MAC Short Address" mask="0x10" name="SHORT_ADDR_04"/>
          <bitfield caption="MAC Short Address" mask="0x08" name="SHORT_ADDR_03"/>
          <bitfield caption="MAC Short Address" mask="0x04" name="SHORT_ADDR_02"/>
          <bitfield caption="MAC Short Address" mask="0x02" name="SHORT_ADDR_01"/>
          <bitfield caption="MAC Short Address" mask="0x01" name="SHORT_ADDR_00"/>
        </register>
        <register caption="Transceiver MAC Short Address Register (High Byte)" name="SHORT_ADDR_1" offset="0x161" size="1">
          <bitfield caption="MAC Short Address" mask="0xFF" name="SHORT_ADDR_" lsb="10"/>
        </register>
        <register caption="Transceiver Personal Area Network ID Register (Low Byte)" name="PAN_ID_0" offset="0x162" size="1">
          <bitfield caption="MAC Personal Area Network ID" mask="0x80" name="PAN_ID_07"/>
          <bitfield caption="MAC Personal Area Network ID" mask="0x40" name="PAN_ID_06"/>
          <bitfield caption="MAC Personal Area Network ID" mask="0x20" name="PAN_ID_05"/>
          <bitfield caption="MAC Personal Area Network ID" mask="0x10" name="PAN_ID_04"/>
          <bitfield caption="MAC Personal Area Network ID" mask="0x08" name="PAN_ID_03"/>
          <bitfield caption="MAC Personal Area Network ID" mask="0x04" name="PAN_ID_02"/>
          <bitfield caption="MAC Personal Area Network ID" mask="0x02" name="PAN_ID_01"/>
          <bitfield caption="MAC Personal Area Network ID" mask="0x01" name="PAN_ID_00"/>
        </register>
        <register caption="Transceiver Personal Area Network ID Register (High Byte)" name="PAN_ID_1" offset="0x163" size="1">
          <bitfield caption="MAC Personal Area Network ID" mask="0xFF" name="PAN_ID_" lsb="10"/>
        </register>
