avr-rust/avrd/packs/atmega/ATmega2564RFR2.atdf
        <register caption="Transceiver MAC IEEE Address Register 0" name="IEEE_ADDR_0" offset="0x164" size="1">
          <bitfield caption="MAC IEEE Address" mask="0x80" name="IEEE_ADDR_07"/>
          <bitfield caption="MAC IEEE Address" mask="0x40" name="IEEE_ADDR_06"/>
          <bitfield caption="MAC IEEE Address" mask="0x20" name="IEEE_ADDR_05"/>
          <bitfield caption="MAC IEEE Address" mask="0x10" name="IEEE_ADDR_04"/>
          <bitfield caption="MAC IEEE Address" mask="0x08" name="IEEE_ADDR_03"/>
          <bitfield caption="MAC IEEE Address" mask="0x04" name="IEEE_ADDR_02"/>
          <bitfield caption="MAC IEEE Address" mask="0x02" name="IEEE_ADDR_01"/>
          <bitfield caption="MAC IEEE Address" mask="0x01" name="IEEE_ADDR_00"/>
        </register>
        <register caption="Transceiver MAC IEEE Address Register 1" name="IEEE_ADDR_1" offset="0x165" size="1">
          <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="10"/>
        </register>
        <register caption="Transceiver MAC IEEE Address Register 2" name="IEEE_ADDR_2" offset="0x166" size="1">
          <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="20"/>
        </register>
        <register caption="Transceiver MAC IEEE Address Register 3" name="IEEE_ADDR_3" offset="0x167" size="1">
          <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="30"/>
        </register>
        <register caption="Transceiver MAC IEEE Address Register 4" name="IEEE_ADDR_4" offset="0x168" size="1">
          <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="40"/>
        </register>
        <register caption="Transceiver MAC IEEE Address Register 5" name="IEEE_ADDR_5" offset="0x169" size="1">
          <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="50"/>
        </register>
        <register caption="Transceiver MAC IEEE Address Register 6" name="IEEE_ADDR_6" offset="0x16A" size="1">
          <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="60"/>
        </register>
        <register caption="Transceiver MAC IEEE Address Register 7" name="IEEE_ADDR_7" offset="0x16B" size="1">
          <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="70"/>
        </register>
        <register caption="Transceiver Extended Operating Mode Control Register" name="XAH_CTRL_0" offset="0x16C" size="1">
          <bitfield caption="Maximum Number of Frame Re-transmission Attempts" mask="0xF0" name="MAX_FRAME_RETRIES" values="MAX_FRAME_RETRIES_bitf"/>
          <bitfield caption="Maximum Number of CSMA-CA Procedure Repetition Attempts" mask="0x0E" name="MAX_CSMA_RETRIES" values="MAX_CSMA_RETRIES_bitf"/>
          <bitfield caption="Set Slotted Acknowledgment" mask="0x01" name="SLOTTED_OPERATION" values="SLOTTED_OPERATION_BITF"/>
        </register>
        <register caption="Transceiver CSMA-CA Random Number Generator Seed Register" name="CSMA_SEED_0" offset="0x16D" size="1">
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x80" name="CSMA_SEED_07"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x40" name="CSMA_SEED_06"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x20" name="CSMA_SEED_05"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x10" name="CSMA_SEED_04"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x08" name="CSMA_SEED_03"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x04" name="CSMA_SEED_02"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x02" name="CSMA_SEED_01"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x01" name="CSMA_SEED_00"/>
        </register>
        <register caption="Transceiver Acknowledgment Frame Control Register 2" name="CSMA_SEED_1" offset="0x16E" size="1">
          <bitfield caption="Acknowledgment Frame Filter Mode" mask="0xC0" name="AACK_FVN_MODE" values="AACK_FVN_MODE_bitf"/>
          <bitfield caption="Set Frame Pending Sub-field" mask="0x20" name="AACK_SET_PD"/>
          <bitfield caption="Disable Acknowledgment Frame Transmission" mask="0x10" name="AACK_DIS_ACK"/>
          <bitfield caption="Set Personal Area Network Coordinator" mask="0x08" name="AACK_I_AM_COORD"/>
          <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x07" name="CSMA_SEED_1"/>
        </register>
        <register caption="Transceiver CSMA-CA Back-off Exponent Control Register" name="CSMA_BE" offset="0x16F" size="1">
          <bitfield caption="Maximum Back-off Exponent" mask="0xF0" name="MAX_BE" values="MAX_BE_bitf"/>
          <bitfield caption="Minimum Back-off Exponent" mask="0x0F" name="MIN_BE" values="MIN_BE_bitf"/>
        </register>
        <register caption="Transceiver Digital Test Control Register" name="TST_CTRL_DIGI" offset="0x176" size="1">
          <bitfield caption="Digital Test Controller Register" mask="0x0F" name="TST_CTRL_DIG" values="TST_CTRL_DIG_BITF"/>
        </register>
        <register caption="Transceiver Received Frame Length Register" name="TST_RX_LENGTH" offset="0x17B" size="1">
          <bitfield caption="Received Frame Length" mask="0xFF" name="RX_LENGTH"/>
        </register>
        <register caption="Start of frame buffer" name="TRXFBST" offset="0x180" size="1" mask="0xFF"/>
        <register caption="End of frame buffer" name="TRXFBEND" offset="0x1FF" size="1" mask="0xFF"/>
      </register-group>
      <value-group caption="" name="PALTD_bitf">
        <value caption="-3us" name="PALTD_MINUS_3US" value="0"/>
        <value caption="-2us" name="PALTD_MINUS_2US" value="1"/>
        <value caption="-1us" name="PALTD_MINUS_1US" value="2"/>
        <value caption="0us" name="PALTD_0US" value="3"/>
        <value caption="1us" name="PALTD_1US" value="4"/>
        <value caption="2us" name="PALTD_2US" value="5"/>
        <value caption="3us" name="PALTD_3US" value="6"/>
        <value caption="4us" name="PALTD_4US" value="7"/>
      </value-group>
      <value-group caption="" name="PALTU_bitf">
        <value caption="-3us" name="PALTU_MINUS_3US" value="0"/>
        <value caption="-2us" name="PALTU_MINUS_2US" value="1"/>
        <value caption="-1us" name="PALTU_MINUS_1US" value="2"/>
        <value caption="0us" name="PALTU_0US" value="3"/>
        <value caption="1us" name="PALTU_1US" value="4"/>
        <value caption="2us" name="PALTU_2US" value="5"/>
        <value caption="3us" name="PALTU_3US" value="6"/>
        <value caption="4us" name="PALTU_4US" value="7"/>
      </value-group>
      <value-group caption="" name="AES_MODE_BITF">
        <value caption="AES Mode is ECB (Electronic Code Book)." name="AES_MODE_ECB" value="0"/>
        <value caption="AES Mode is CBC (Cipher Block Chaining)." name="AES_MODE_CBC" value="1"/>
      </value-group>
      <value-group caption="" name="AES_DIRECTION_BITF">
        <value caption="AES operation is encryption." name="AES_DIR_ENC" value="0"/>
        <value caption="AES operation is decryption." name="AES_DIR_DEC" value="1"/>
      </value-group>
      <value-group caption="" name="CCA_DONE_bitf">
        <value caption="CCA calculation not finished" name="CCA_NOT_FIN" value="0"/>
        <value caption="CCA calculation finished" name="CCA_FIN" value="1"/>
      </value-group>
