avr-rust/avrd/packs/atmega/ATmega2564RFR2.atdf
      <value-group caption="" name="SCCKDIV_BITF">
        <value caption="Transceiver Clock divided by 256, (62.5kHz)" name="VAL_0" value="0"/>
        <value caption="Transceiver Clock divided by 128, (125kHz)" name="VAL_1" value="1"/>
        <value caption="Transceiver Clock divided by 64,  (250kHz)" name="VAL_2" value="2"/>
        <value caption="Transceiver Clock divided by 32,  (500kHz)" name="VAL_3" value="3"/>
        <value caption="Transceiver Clock divided by 16,  (1MHz)" name="VAL_4" value="4"/>
        <value caption="Transceiver Clock divided by 8,   (2MHz)" name="VAL_5" value="5"/>
        <value caption="Transceiver Clock divided by 4,   (4MHz)" name="VAL_6" value="6"/>
      </value-group>
      <value-group caption="" name="SCCS3_BITF">
        <value caption="Compare Unit 3 Relative Compare Source = Beacon Timestamp Register" name="VAL_0" value="0"/>
        <value caption="Compare Unit 3 Relative Compare Source = Transmit Frame Timestamp Register" name="VAL_1" value="1"/>
        <value caption="Compare Unit 3 Relative Compare Source = Received Frame Timestamp Register" name="VAL_2" value="2"/>
      </value-group>
      <value-group caption="" name="SCCS2_BITF">
        <value caption="Compare Unit 2 Relative Compare Source = Beacon Timestamp Register" name="VAL_0" value="0"/>
        <value caption="Compare Unit 2 Relative Compare Source = Transmit Frame Timestamp Register" name="VAL_1" value="1"/>
        <value caption="Compare Unit 2 Relative Compare Source = Received Frame Timestamp Register" name="VAL_2" value="2"/>
      </value-group>
      <value-group caption="" name="SCCS1_BITF">
        <value caption="Compare Unit 1 Relative Compare Source = Beacon Timestamp Register" name="VAL_0" value="0"/>
        <value caption="Compare Unit 1 Relative Compare Source = Transmit Frame Timestamp Register" name="VAL_1" value="1"/>
        <value caption="Compare Unit 1 Relative Compare Source = Received Frame Timestamp Register" name="VAL_2" value="2"/>
      </value-group>
    </module>
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Address Register  Bytes" name="EEAR" offset="0x41" size="2" mask="0xFFFF"/>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1" mask="0xFF"/>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
          <bitfield caption="EEPROM Programming Mode" mask="0x30" name="EEPM" values="EEP_MODE2"/>
          <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
          <bitfield caption="EEPROM Programming Enable" mask="0x02" name="EEPE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
      <value-group caption="" name="EEP_MODE2">
        <value caption="Erase and Write in one operation (Atomic Operation)" name="VAL_0x00" value="0x00"/>
        <value caption="Erase only" name="VAL_0x01" value="0x01"/>
        <value caption="Write only" name="VAL_0x02" value="0x02"/>
        <value caption="Reserved for future use" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="JTAG Interface" name="JTAG">
      <register-group caption="JTAG Interface" name="JTAG">
        <register caption="On-Chip Debug Register" name="OCDR" offset="0x51" size="1" ocd-rw="">
          <bitfield caption="On-Chip Debug Register Data" mask="0xFF" name="OCDR" values="OCDR_DATA_BITF"/>
        </register>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
          <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
        </register>
      </register-group>
      <value-group caption="" name="OCDR_DATA_BITF">
        <value caption="Refer to the debugger documentation for further information on how to use this register." name="VAL_0" value="0"/>
      </value-group>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="External Interrupt Control Register A" name="EICRA" offset="0x69" size="1">
          <bitfield caption="External Interrupt 3 Sense Control Bit" mask="0xC0" name="ISC3" values="INTERRUPT_SENSE_CONTROL3"/>
          <bitfield caption="External Interrupt 2 Sense Control Bit" mask="0x30" name="ISC2" values="INTERRUPT_SENSE_CONTROL3"/>
          <bitfield caption="External Interrupt 1 Sense Control Bit" mask="0x0C" name="ISC1" values="INTERRUPT_SENSE_CONTROL3"/>
          <bitfield caption="External Interrupt 0 Sense Control Bit" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL3"/>
        </register>
        <register caption="External Interrupt Control Register B" name="EICRB" offset="0x6A" size="1">
          <bitfield caption="External Interrupt 7 Sense Control Bit" mask="0xC0" name="ISC7" values="INTERRUPT_SENSE_CONTROL3"/>
          <bitfield caption="External Interrupt 6 Sense Control Bit" mask="0x30" name="ISC6" values="INTERRUPT_SENSE_CONTROL3"/>
          <bitfield caption="External Interrupt 5 Sense Control Bit" mask="0x0C" name="ISC5" values="INTERRUPT_SENSE_CONTROL3"/>
          <bitfield caption="External Interrupt 4 Sense Control Bit" mask="0x03" name="ISC4" values="INTERRUPT_SENSE_CONTROL3"/>
        </register>
        <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
          <bitfield caption="External Interrupt Request Enable" mask="0xFF" name="INT" values="INTERRUPT_REQ_ENABLE_BITF"/>
        </register>
        <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
          <bitfield caption="External Interrupt Flag" mask="0xFF" name="INTF" values="INTERRUPT_EXT_FLAG_BITF"/>
        </register>
        <register caption="Pin Change Mask Register 2" name="PCMSK2" offset="0x6D" size="1">
          <bitfield caption="Pin Change Enable Mask" mask="0xFF" name="PCINT" lsb="16"/>
        </register>
